app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    @restaurants = Restaurant.all

INSERT INTO "restaurants" ("name", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "American Diner"], ["created_at", 2016-07-12 13:09:55 UTC], ["updated_at", 2016-07-12 13:09:55 UTC], ["description", "Great cheese burgers"]]
---
  def create
    Restaurant.create(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def show
    @restaurant = Restaurant.find(params[:id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 179], ["LIMIT", 1]]
---
  def edit
    @restaurant = Restaurant.find(params[:id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 198], ["LIMIT", 1]]
UPDATE "restaurants" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["name", nil], ["description", nil], ["updated_at", 2016-07-12 15:35:53 UTC], ["id", 198]]
---
  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 312], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 312]]
---
  def destroy
    @restaurant = Restaurant.find(params[:id])
    @restaurant.destroy